doc/post002_polynomials.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-31 Fri 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marco Paolo Valerio Vezzoli" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26a4469">1. polynomials</a>
<ul>
<li><a href="#org59e2c94">1.1. the structure</a></li>
<li><a href="#org8dfc56a">1.2. the basic operations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org26a4469" class="outline-2">
<h2 id="org26a4469"><span class="section-number-2">1</span> polynomials</h2>
<div class="outline-text-2" id="text-1">
<p>
polynomials are a fundamental mathematical entity used for a number
of interesting applications including:
</p>
<ul class="org-ul">
<li>approximation of more complex functions</li>
<li>interpolation</li>
<li>error correction codes</li>
<li>graphical interpolation of curves (splines)</li>
</ul>

<p>
I'm going to work with monovariate polynomials, i.e. polynomials of
one variable only
</p>
</div>
<div id="outline-container-org59e2c94" class="outline-3">
<h3 id="org59e2c94"><span class="section-number-3">1.1</span> the structure</h3>
<div class="outline-text-3" id="text-1-1">
<p>
a polynomial is completely defined by a string of values in a
field. These represents the polynomial coefficient from the lowest
to the highest grade (let's call it \(n\)); the highest grade
coeddicient is supposed to be different from the zero of the field,
and all coefficient of degree greather than \(n\) are supposed to be
zero.
</p>

<p>
Main operation needed to define a polynomial are sum and
multiplication thus it can be possible to use fields different from
usual built-in types (integer and floating point numbers) as long as
multiplication and sum are defined.
</p>

<p>
Thus the data structure will contain a vector of values where sum
and multiplication are defined. The vector is needed because we
cannot know the length of the coefficient string in advance.
</p>

<p>
At first I will add only a public constructor: coefficients should
be immutable from the user perspective.
</p>
<div class="org-src-container">
<pre class="src src-rust" id="orgd45d18e"><span style="color: #23d7d7;">#[derive(Debug)]</span>
<span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #34cae2;">Poly</span> &lt;<span style="color: #34cae2;">T</span>&gt;{
    <span style="color: #dbdb95;">coeff</span> : <span style="color: #34cae2;">Vec</span>&lt;<span style="color: #34cae2;">T</span>&gt;
}

<span style="color: #ffad29; font-weight: bold;">impl</span>&lt;<span style="color: #34cae2;">T</span>&gt; <span style="color: #34cae2;">Poly</span>&lt;<span style="color: #34cae2;">T</span>&gt;{
    <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">new</span>(<span style="color: #dbdb95;">coeff</span> : <span style="color: #34cae2;">Vec</span>&lt;<span style="color: #34cae2;">T</span>&gt;) -&gt; <span style="color: #34cae2;">Poly</span>&lt;<span style="color: #34cae2;">T</span>&gt;{
        <span style="color: #34cae2;">Poly</span>{ <span style="color: #dbdb95;">coeff</span>:coeff }
    }
}
</pre>
</div>

<p>
I can also add a test to this file in order to make sure it is
compiled properly. I will import Write in order to use a print debug
and check all is ok
</p>
<div class="org-src-container">
<pre class="src src-rust" id="org60fcb21"><span style="color: #23d7d7;">#[cfg(test)]</span>
<span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">tests</span> {
    <span style="color: #ffad29; font-weight: bold;">use</span> <span style="color: #ffad29; font-weight: bold;">super</span>::<span style="color: #34cae2;">Poly</span>;
    <span style="color: #ffad29; font-weight: bold;">use</span> <span style="color: #008b8b;">std</span>::<span style="color: #008b8b;">fmt</span>::<span style="color: #34cae2;">Write</span> <span style="color: #ffad29; font-weight: bold;">as</span> <span style="color: #34cae2;">FmtWrite</span>;
    <span style="color: #23d7d7;">#[test]</span>
    <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">creation_and_debug</span>() {
        <span style="color: #ffad29; font-weight: bold;">let</span> <span style="color: #dbdb95;">x</span> = <span style="color: #34cae2;">Poly</span>::new(<span style="color: #23d7d7;">vec!</span>[1,2,3]);
        <span style="color: #ffad29; font-weight: bold;">let</span> <span style="color: #ffad29; font-weight: bold;">mut</span> <span style="color: #dbdb95;">s</span> = <span style="color: #34cae2;">String</span>::new();
        <span style="color: #23d7d7;">write!</span>(&amp;<span style="color: #ffad29; font-weight: bold;">mut</span> s, <span style="color: #e67128;">"</span><span style="color: #e67128; font-style: italic;">{:?}</span><span style="color: #e67128;">"</span>, x);
        <span style="color: #23d7d7;">assert_eq!</span>(s, <span style="color: #e67128;">"Poly { coeff: [1, 2, 3] }"</span>);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8dfc56a" class="outline-3">
<h3 id="org8dfc56a"><span class="section-number-3">1.2</span> the basic operations</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I'd like to evaluate a polynomial in a point of its field. In order
to do that I need the data to have the following properties:
</p>
<ul class="org-ul">
<li>sum is defined</li>
<li>multiplication is defined</li>
<li>there is a zero (neutral element of the sum)</li>
<li>the field values can be copied (i.e. there is a way to safely
copy their binary representation)</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust" id="orgfb9b04e"><span style="color: #ffad29; font-weight: bold;">use</span> <span style="color: #008b8b;">std</span>::<span style="color: #008b8b;">ops</span>::{<span style="color: #34cae2;">Mul</span>, <span style="color: #34cae2;">Add</span>};

<span style="color: #23d7d7;">#[derive(Debug)]</span>
<span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #34cae2;">Poly</span> &lt;<span style="color: #34cae2;">T</span>&gt;{
    <span style="color: #dbdb95;">coeff</span> : <span style="color: #34cae2;">Vec</span>&lt;<span style="color: #34cae2;">T</span>&gt;
}

<span style="color: #ffad29; font-weight: bold;">impl</span>&lt;<span style="color: #dbdb95;">T</span>: <span style="color: #34cae2;">Mul</span>&lt;<span style="color: #34cae2;">Output</span> = <span style="color: #34cae2;">T</span>&gt; + <span style="color: #34cae2;">Add</span>&lt;<span style="color: #34cae2;">Output</span> = <span style="color: #34cae2;">T</span>&gt; + <span style="color: #34cae2;">Copy</span>&gt; <span style="color: #34cae2;">Poly</span>&lt;<span style="color: #34cae2;">T</span>&gt;{
    <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">new</span>(<span style="color: #dbdb95;">coeff</span> : <span style="color: #34cae2;">Vec</span>&lt;<span style="color: #34cae2;">T</span>&gt;) -&gt; <span style="color: #34cae2;">Poly</span>&lt;<span style="color: #34cae2;">T</span>&gt;{
        <span style="color: #34cae2;">Poly</span>{ <span style="color: #dbdb95;">coeff</span>:coeff }
    }
    <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">eval</span>(<span style="color: #ffad29; font-weight: bold;">self</span> : &amp;<span style="color: #34cae2;">Poly</span>&lt;<span style="color: #34cae2;">T</span>&gt;, <span style="color: #dbdb95;">x</span> : <span style="color: #34cae2;">T</span>, <span style="color: #dbdb95;">zero</span> : <span style="color: #34cae2;">T</span>) -&gt; <span style="color: #34cae2;">T</span> {
        <span style="color: #ffad29; font-weight: bold;">self</span>.coeff.iter()
            .rev()
            .fold(zero, |acc, c| acc * x + *c)
    }
}
</pre>
</div>

<p>
I can also add a test to this file in order to make sure it is
compiled properly
</p>
<div class="org-src-container">
<pre class="src src-rust" id="org8f4e838"><span style="color: #23d7d7;">#[test]</span>
<span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">test_evaluation</span>() {
    <span style="color: #ffad29; font-weight: bold;">let</span> <span style="color: #dbdb95;">p</span> = <span style="color: #34cae2;">Poly</span>::new(<span style="color: #23d7d7;">vec!</span>[1,2,3]);
    <span style="color: #23d7d7;">assert_eq!</span>(p.eval(10,0), 321);
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marco Paolo Valerio Vezzoli</p>
<p class="date">Created: 2021-12-31 Fri 11:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
